; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 302231 2 2 3 4 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	spectrograph2 - mode
	thermograph0 - mode
	image1 - mode
	GroundStation1 - direction
	Star3 - direction
	GroundStation0 - direction
	GroundStation2 - direction
	Phenomenon4 - direction
	Star5 - direction
	Planet6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
	(supports instrument1 image1)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon4)
)
(:goal (and
	(have_image Phenomenon4 thermograph0)
	(have_image Star5 thermograph0)
	(have_image Planet6 image1)
	(have_image Planet7 image1)
	(have_image Phenomenon8 spectrograph2)
	(have_image Planet9 image1)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 6
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
3. (turn_to satellite1 planet9 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 planet9)
   goals met: 0 of 6
4. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 0 of 6
5. (turn_to satellite1 groundstation2 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 groundstation2)
   goals met: 0 of 6
6. (turn_to satellite0 star5 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star5)
   goals met: 0 of 6
7. (calibrate satellite1 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 0 of 6
8. (take_image satellite0 star5 instrument0 thermograph0)
   added: (have_image star5 thermograph0)
   goals met: 1 of 6
9. (turn_to satellite1 planet9 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 planet9)
   goals met: 1 of 6
10. (turn_to satellite0 phenomenon4 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon4)
   goals met: 1 of 6
11. (take_image satellite1 planet9 instrument1 image1)
   added: (have_image planet9 image1)
   goals met: 2 of 6
12. (take_image satellite0 phenomenon4 instrument0 thermograph0)
   added: (have_image phenomenon4 thermograph0)
   goals met: 3 of 6
13. (turn_to satellite1 planet7 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 planet7)
   goals met: 3 of 6
14. (turn_to satellite0 phenomenon8 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 phenomenon8)
   goals met: 3 of 6
15. (take_image satellite1 planet7 instrument1 image1)
   added: (have_image planet7 image1)
   goals met: 4 of 6
16. (turn_to satellite1 planet6 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet6)
   goals met: 4 of 6
17. (take_image satellite0 phenomenon8 instrument0 spectrograph2)
   added: (have_image phenomenon8 spectrograph2)
   goals met: 5 of 6
18. (take_image satellite1 planet6 instrument1 image1)
   added: (have_image planet6 image1)
   goals met: 6 of 6
